# Условие
# Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:
print("введите имя")
name = input()
print("Hello, " + name + "!")
