# Условие
# Даны два целых числа. Выведите значение наименьшего из них.
print("введите первое число")
a = int(input())
print("введите второе число")
b = int(input())
if a > b:
    print(b)
else:
    print(a)
